package main

import (
	"fmt"
	"os"
	"strings"
)

var (
	result = "提振挺捷拉拓拥戈成战戚戴房所才扬承懿意慈慕慧悦惠怀思怡恒恩恬 恺林果枝枫柏查柯柱柳柴月有朋朗望朝木本朱朴权杉李杏杜来杨杭杰 松曙曦曲曹曼曾昀昂昆昊昌明易昕星映春昭昱显晋晏晓晔晖晗晟晨普 景晴晶智文斌斐斯新方施旋旗日旦旭时旸旺旻攀支放政效敏敖敦敬段 殷殿毅毓毕毛欢欣欧歌正步武樊榕楚楠楷楼梁梅梓梦棋森标栋树栗根 格栾桂桃桐桑桢桥桦澄澜漫潇潘潮源溪滔滕满滢滨清渊渝温港游湖湘 湛涂涌涛润涵淇淑淮深淳添淼洁洋洛津洪洲济浙浦浩浪海沁沈沐沙沛 河治泉泓法波泰泳泽民水永汇汉汝江池汤汪玄玉王玛玥玫玮环现玲玺 珂珊珍珏珠班珺猛献爱爽牛牟特熊熙熠燕焕焦焱然煌煜照炎炜炯炳烈 烨热烽瀚瀛灏火灵灿瞿知石真睿皓盈益盛盟相盼登白百疆甄甘甜生甫 田甲申男畅留璇璐璞璟球理琛琦琨琪琰琳琴琼瑛瑜瑞瑶瑾简管笑笛符 策筠筱窦立竞章童端竹程稳穆穗禄福禹禾秀秉秋科秦礼社祁祎祖祝祥 祯祺碧磊研硕美群羽翁翔翟翠翰翼缪罗罡红纪纬纯纲纳练绍经继绪绮 维繁素索紫粤米侃依侠侯俊俐保俞信俭修伊伍众优会伟传伦伯伶佐佑 何佘余作佟佩佳予争事二于云五井亚亦京亭亮人仁仇从仕付仙代令以 仪仲任一丁万三上不世丘丙业丛东严中丰临丹为丽举乃久义之乌乐乔 九习书买乾厚原友双发口古召可台史叶司包化北匡区千升卉华卓单南 博卜卞占卡卢卫印卿力功加务努劲劳勇勋勤刁分刘则刚创初利前剑冀 内冉再军农冠冬冯冰冲冷凌凡凤凯儒允元兆先光克党全公兰关兴兵其 典傅储倩倪健垚城培基圆圣在地圳均坚坤四园国图嘉善喆喜喻唐唯商啸和咏品哈哲合吉同名吐向吕君含启吴吾周呼宁宇守安宋宏宗官定宜 宝实宣宪宫家宸容宽宾寅寇富寒寿子孔存孙孜孝孟季学媚媛威娄娅娇 娜娟娣娥娴婉婕婧婵婷如妍妙妤妮妹姗姚姜姝姣姬夏多大天太夫奇奉 奎奕奚奥好增墨士壮声堂堃塔征律徐得微德徽心必志忠念开弘张强彤 彦彩彪彬彭影庄庆库应庚庞度庭康廉廖延廷建市布帅帆师希席帮常干 平年幸广巍川州左巧巨巩巫巴崇崔嵘嵩岑岗岚岛岩岭岳峥峰峻封尊小 少尔尚尤尧尹尼居屈展山屹0123456789莉莎莫莲莹菁菊菲 茂范茜茵茹荆荣芝芦芬芮花芳芷芸芹苏苑苗苟若英苹舒舜舟航良艳艺 艾臣臧自至致臻腾肃肖育胜胡胥能耀耿聂联聚聪融蜀虎虞虹薇薛蔚蔡 蔺蕊蕴蕾蒋蒙蒲蓉蓓蓝萌萍营萧萱葛董计训许诗诚语诺誉言詹覃见观 解褚西袁裕裴行衍衡辉辛辰边辽达迅迎运进远连迟迪述车轩轶超越跃 路贝贞财贤贵费贺贾赖赛赞赟赫赵起谈谋谌谢谦谭谷豪豫鉴里重野金 邓邝邢那邦邬邱邵邹郁郎郑郝郭都选通逸道遥鞠韦韩韬音韵韶霄震霍 霏霖霜霞露青靓靖静非革靳隆隋隽雁雄雅雍雨雪雯雷阁阎阮阳阿陆陈 陕陶门闫闯闵闻闽锋锐锡锦键镇镜长钊钟钢钦钧钰钱铁铃铭铮银鑫魁 魏骁骆骏骥高马驰首香馨饶颂领颖颜风飞项顺顾龙龚鼎齐麒麟麦麻黄 黎黑黔鸣鸽鸿鹏鹤鹰鹿鲁鲍鲜"
)

func step2() {
	result = strings.ReplaceAll(result, " ", "")
	strList := make([]string, 0)
	for _, v := range result {
		strList = append(strList, string(v))
		//fmt.Printf("%d -> %s\n", i/3, string(v))
	}

	indexList := make([]string, 0)
	for i := 0; i <= 65535; i++ {
		if hasChar(i) {
			indexList = append(indexList, to16(i))
		}
	}

	if len(strList) != len(indexList) {
		panic(fmt.Errorf("char count error: %d -> %d", len(strList), len(indexList)))
	}

	json := "{"

	for i, index := range indexList {
		json += "\"" + index + "\":\"" + strList[i] + "\","
	}
	json = json[0 : len(json)-1]
	json += "}"

	file, _ := os.Create("result.json")
	_, _ = file.Write([]byte(json))
}

func to16(i int) string {
	str := fmt.Sprintf("%x", i)
	str = strings.ToUpper(str)
	switch len(str) {
	case 1:
		str = "000" + str
	case 2:
		str = "00" + str
	case 3:
		str = "0" + str
	}
	return str
}
